# Install everything: brew bundle
# Update Brewfile from current state: brew bundle dump --force

# ── Shell ──────────────────────────────────────────────────────────────────────
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "atuin"
brew "direnv"
brew "fzf"
# fzf-tab: not on brew — installed via install.sh (git clone https://github.com/Aloxaf/fzf-tab ~/.fzf-tab)

# ── Version manager ────────────────────────────────────────────────────────────
brew "mise"

# ── Editor ─────────────────────────────────────────────────────────────────────
brew "neovim"

# ── Multiplexer ────────────────────────────────────────────────────────────────
brew "tmux"

# ── Git ────────────────────────────────────────────────────────────────────────
brew "git"
brew "aws-vault"
brew "git-delta"
brew "lazygit"
brew "gh"

# ── File / search tools ────────────────────────────────────────────────────────
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "yazi"
brew "btop"

# ── Dev tools ──────────────────────────────────────────────────────────────────
brew "jq"
brew "shellcheck"
brew "shfmt"

# ── Fonts ──────────────────────────────────────────────────────────────────────
# Nerd Font patches are in homebrew/cask — no extra tap needed
cask "font-caskaydia-cove-nerd-font"
# Alternatives worth trying: font-monaspace-nerd-font (GitHub, texture healing), font-jetbrains-mono-nerd-font

# ── Terminal ───────────────────────────────────────────────────────────────────
cask "ghostty"
# wezterm: used on Windows — install via https://wezfurlong.org/wezterm/installation.html
# cask "wezterm"  # uncomment if you want it on macOS too

# ── macOS window manager ───────────────────────────────────────────────────────
# AeroSpace is distributed via its own tap:
#   brew install nikitabobko/tap/aerospace
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"

# ── Keyboard remapper ──────────────────────────────────────────────────────────
# Kanata requires manual install — see https://github.com/jtroo/kanata/releases
